def alphavet(s):
    alpha= dict( a = '00000', b = '00001', v = '00010', g = '00011', d = '00100', e = '00101', zh = '00110', z = '00111', i = '01000', ij = '01001', k = '01010', l = '01011', m = '01100', n = '01101', o = '01110', p = '01111', r = '10000', s = '10001', t = '10010', u = '10011', ph = '10100', h = '10101', c = '10110', ch = '10111', sh = '11000', scch = '11001', sft = '11010', q = '11011', hrd = '11100', ea = '11101', y = '11110', ya = '11111')
    return a
print("Здравствуйте! Это программа для шифровки сообщения в двоичный код ( и разшифровки из него, разумеется)! ;>")
print("Выберите действие: Зашифровка - 'z'/ Расшифровка - 'r'")
action = input()
match action:
    case "z":
        print("Введите сообщеение")
        mes=input()
        alphabet(mes)


    case "r":
        a = "a"

    case _:
        print("Такого действия нет")


