import random
def alphavet(s):
    alpha= dict( а = '00000', б = '00001', в = '00010', г = '00011', д = '00100', е = '00101', ж = '00110', з = '00111', и = '01000', й = '01001', к = '01010', л = '01011', м = '01100', н = '01101', о = '01110', п = '01111', р = '10000', с = '10001', т = '10010', у = '10011', ф = '10100', х = '10101', ц = '10110', ч = '10111', ш = '11000', щ = '11001', ь = '11010', ы = '11011', ъ = '11100', э = '11101', ю = '11110', я = '11111')
    l2=list(s)
    l_s = len(l2)#длинна массива
    gg=[]
    for i in range (l_s):
        gg.append(alpha.get(l2[i],0))
    print(gg)#это не должно выводиться в итоге
    pp=[]
    f = open('key.txt', 'w')
    rnd_1 = 0
    for j in range (l_s*5):
        rnd_1 = random.randint(0,1)
        pp.append(rnd_1)
        f.write(str(rnd_1))
    f.close()



print("Здравствуйте! Это программа для шифровки сообщения в двоичный код ( и разшифровки из него, разумеется)! ;>")
print("Выберите действие: Зашифровка - 'z'/ Расшифровка - 'r'")
action = input()
match action:
    case "z":
        print("Введите сообщеение без пробелов")
        mes=input()
        alphavet(mes)


    case "r":
        a = "a"

    case _:
        print("Такого действия нет")


